public/man/man1/cups-config.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - cups-config.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - cups-config.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>cups-config - get cups api, compiler, directory, and link information
(deprecated).</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>cups-config</strong> <em>–api-version</em><br>
<strong>cups-config</strong> <em>–build</em><br>
<strong>cups-config</strong> <em>–cflags</em><br>
<strong>cups-config</strong> <em>–datadir</em><br>
<strong>cups-config</strong> <em>–help</em><br>
<strong>cups-config</strong> <em>–ldflags</em><br>
<strong>cups-config</strong> [ <em>–image</em> ] [ <em>–static</em> ] <em>–libs</em><br>
<strong>cups-config</strong> <em>–serverbin</em><br>
<strong>cups-config</strong> <em>–serverroot</em><br>
<strong>cups-config</strong> <em>–version</em>\\</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>The <strong>cups-config</strong> command allows application developers to determine the
necessary command-line options for the compiler and linker, as well as
the installation directories for filters, configuration files, and
drivers. All values are reported to the standard output. <strong>Note:</strong> This
command is deprecated and will be removed in a future version of CUPS.
The *pkg-config*(1) command should be used instead.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
OPTIONS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The <strong>cups-config</strong> command accepts the following command-line options:</p>
<dl>
<dt>
<strong>–api-version</strong>
</dt>
<dd>Reports the current API version (major.minor).</dd>
<dt>
<strong>–build</strong>
</dt>
<dd>Reports a system-specific build number.</dd>
<dt>
<strong>–cflags</strong>
</dt>
<dd>Reports the necessary compiler options.</dd>
<dt>
<strong>–datadir</strong>
</dt>
<dd>Reports the default CUPS data directory.</dd>
<dt>
<strong>–help</strong>
</dt>
<dd>Reports the program usage message.</dd>
<dt>
<strong>–ldflags</strong>
</dt>
<dd>Reports the necessary linker options.</dd>
<dt>
<strong>–libs</strong>
</dt>
<dd>Reports the necessary libraries to link to.</dd>
<dt>
<strong>–serverbin</strong>
</dt>
<dd>Reports the default CUPS binary directory, where
filters and backends are stored.</dd>
<dt>
<strong>–serverroot</strong>
</dt>
<dd>Reports the default CUPS configuration file
directory.</dd>
<dt>
<strong>–static</strong>
</dt>
<dd>When used with <em>–libs</em>, reports the static libraries
instead of the default (shared) libraries.</dd>
<dt>
<strong>–version</strong>
</dt>
<dd>Reports the full version number of the CUPS
installation (major.minor.patch).</dd>
</dl>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
EXAMPLES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>Show the currently installed version of CUPS:</p>
<pre class="example">
    cups-config --version
</pre>
<p>
Compile a simple one-file CUPS filter:</p>
<pre class="example">
    cc `cups-config --cflags --ldflags` -o filter filter.c \
        `cups-config --libs`
</pre>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
DEPRECATED OPTIONS
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>The following options are deprecated but continue to work for backwards
compatibility:</p>
<dl>
<dt>
<strong>–image</strong>
</dt>
<dd>Formerly used to add the CUPS imaging library to the list
of libraries.</dd>
</dl>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
SEE ALSO
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>*cups*(1), *pkg-config*(1), CUPS Online Help (<a href="http://localhost:631/help)">http://localhost:631/help)</a></p>
</div>
</div>
<div id="outline-container-headline-8" class="outline-2">
<h2 id="headline-8">
COPYRIGHT
</h2>
<div id="outline-text-headline-8" class="outline-text-2">
<p>Copyright © 2020-2024 by OpenPrinting.</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
